GIT/src/DataProcessors/Авторизация/Авторизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Авторизация</name>
</mdclass:DataProcessor>

GIT/src/InformationRegisters/ЗаданияАвторизации/ЗаданияАвторизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияАвторизации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗадания</name>
    <type>
      <types>EnumRef.СтатусЗаданийАвторизации</types>
    </type>
  </resources>
  <attributes>
    <name>КодАвторизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЗадания</name>
    <type>
      <types>EnumRef.ВидЗаданийАвторизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GIT/src/Catalogs/СценарииВыполненияАвторизации/СценарииВыполненияАвторизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииВыполненияАвторизации</name>
  <predefined>
    <items>
      <name>Авторизация</name>
      <description>Авторизация</description>
    </items>
    <items>
      <name>ВводКода</name>
      <description>Ввод кода</description>
    </items>
  </predefined>
  <attributes>
    <name>ТекстСценария</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

GIT/src/DataProcessors/Авторизация/ManagerModule.bsl
Функция СоздатьФайлСценария(Сценарий, КодАвторизации = "") Экспорт
	
	Если Сценарий = Справочники.СценарииВыполненияАвторизации.ВводКода Тогда		
		ТекстСценария = СтрЗаменить(Сценарий.ТекстСценария, "000000", КодАвторизации);		
	Иначе		
		ТекстСценария = Сценарий.ТекстСценария;		
	КонецЕсли;
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xtsk");
	
	Текст = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);	
	Текст.Записать(ТекстСценария);		
	Текст.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьЗадание(ВидЗадания, СтатусЗадания, КодАвторизации = "") Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ЗаданияАвторизации.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период 		  = ТекущаяДата();	
	МенеджерЗаписи.ВидЗадания 	  = ВидЗадания;
	МенеджерЗаписи.СтатусЗадания  = СтатусЗадания;
	МенеджерЗаписи.КодАвторизации = КодАвторизации;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
